# НЕ (X < 2) И (X < 5)

# for x in range(1, 100):
#     if not(x < 2) and (x < 5):
#         print(x)
#         break

#-----------------------------------------------------------------------------------------------

# НЕ (X < 2) И (X четное)


# for x in range(1, 100):
#     if not (x < 2) and (x % 2 == 0):
#         print(x)
#         break

#------------------------------------------------------------------------------------------------

# наибольшее
# (X >= 6) И НЕ (X > 12)

# for x in range(1, 100):
#     if (x >= 6) and not (x > 12):
#         print(x)

#-------------------------------------------------------------------------------------------------

#наименьшее 
#НЕ (X < 6) И (X нечетное)

# for x in range(1, 100):
#     if not (x < 6) and (x % 2 != 0):
#         print(x)
#         break

# ----------------------------------------------------------------------------------------------------

# Дано четыре числа: 35, 4598, 54321, 24. Для какого из приведенных чисел истинно высказывание:

# (Число > 100) И НЕ (Число нечетное)

# list = [35, 4598, 54321, 24]

# for i in list:
#     if (i > 100) and not (i % 2 != 0):
#         print(i)

#------------------------------------------------------------------------------------------------------

# Напишите наибольшее двузначное число, меньшее 55, для которого ИСТИННО высказывание:

# (Число < 75) И НЕ (Число четное)

# for i in range(10, 55):
#     if (i < 75) and not (i % 2 == 0):
#         print(i)

#-------------------------------------------------------------------------------------------------------

# Напишите наименьшее целое число 𝑥, для которого ложно высказывание

# НЕ (x < 5) И (x > 2)

for x in range(1, 100):
    if not (x < 5) and (x > 2):
        pass
    else:
        print(x)
        break