
# Было проведено 9 запусков программы, при которых в качестве значений переменных s и t вводились следующие пары чисел:

# (13, 2); (11, 12); (–12, 12); (2, –2); (–10, –10); (6, –5); (2, 8); (9, 10); (1, 13).

# Укажите наименьшее целое значение параметра A, при котором для указанных входных данных программа напечатает «NO» восемь раз.

# def f(s, t, A):
#     if (s > A) or (t > 12):
#         return 0
#     else:
#         return 1
# a = ((13, 2), (11, 12), (-12, 12), (2, -2), (-10, -10), (6, -5), (2, 8), (9, 10), (1, 13))
# kol = 0
# for A in range(100):
#     count = 0
#     for i in range(9):
#         count += f(a[i][0], a[i][1], A)
#     if count == 8:
#         print(A)
#         break

#-------------------------------------------------------------------------------------

# s = int(input())
# t = int(input())
# A = int(input())
# if s > 10 or t > A:
#     print("YES")
# else:
#     print("NO")

# Было проведено 9 запусков программы, при которых вводились следующие пары чисел 
# s, t : (1, 2); (11, 2); (1, 12); (11, 12); (-11, -12); (-11, 12); (-12, 11); (10, 10); (10, 5).
# Укажите минимальное целое значение параметра A, при котором программа напечатает «YES» ровно 5 раз.

# list = [(1, 2), (11, 2), (1, 12), (11, 12), (-11, -12), (-11, 12), (-12, 11), (10, 10), (10, 10), (10, 5)]
# yes = 0
# for A in range(100):
#     yes = 0
#     for i in range(9):
#         s = list[i][0]
#         t = list[i][1]
#         if s > 10 or t > A:
#             yes += 1

#     if yes == 5:
#         print(A)
#         break



