
#При регистрации в компьютерной системе каждому пользователю выдается
# идентификатор из 101 символа, каждый из которых может быть десятичной цифрой
# или одним из 4090 символов из специального набора. Каждый символ кодируется
# с помощью одинакового и минимального количества бит. Идентификатор же
# записывается в памяти с помощью минимально возможного целого количества байт.

# Сколько килобайт потребуется для хранения идентификаторов 2048 пользователей?

# from math import *

# n = 10+4090 #всего вариантов может быть

# i = ceil(log2(n)) #бит на 1 символ

# id = ceil(101 * i / 8)  # байт на 1 ID

# ans = 2048 * id / 1024 #Кбайт на 2048 ID

# print(ans)


# -----------------------------------------------------------------------------------------------


# На предприятии каждой изготовленной детали присваивают серийный номер,
# состоящий из 2783 символов. В базе данных каждый серийный номер занимает
# одинаковое и минимально возможное целое число байт. При этом используется
# посимвольное кодирование серийных номеров, все символы кодируются одинаковым
# и минимально возможным целым числом бит.
# Известно, что для хранения 3 845 627 серийных номеров требуется не менее 11 Гбайт
# памяти. Определите минимально возможную мощность алфавита, используемого
# для записи серийных номеров. В ответе запишите только целое число.

# from math import *

# for n in range(1, 10000):  #перебираем мощности алфавита
#     i = ceil(log2(n)) # бит на 1 символ 
#     ser = ceil(2783 * i / 8) #байтов на 1 серийник
#     if 3_845_627 * ser >= 11*1024*1024*1024: #храниться 3 845 627 номеров, тк храняться они в гигобайтах, переводим в БАЙТЫ
#         print(n)
#         break #так как нам нужно минимальное число по условию


# -----------------------------------------------------------------------------------------------------

# На предприятии каждой изготовленной детали присваивают серийный номер,
# содержащий десятичные цифры и символы из 27-символьного специального
# алфавита. В базе данных каждый серийный номер занимает одинаковое
# и минимально возможное число байт. При этом используется посимвольное
# кодирование серийных номеров, все символы кодируются одинаковым и минимально
# возможным числом бит. Известно, что для хранения 3548 серийных номеров
# необходимо более 12 Кбайт памяти. Определите минимально возможную длину
# серийного номера.

# from math import *

# n = 37
# i = ceil(log2(n)) # бит

# #ser - байт ( /8 )

# for ser in range(1, 10000):
#     if ceil((ser * (i / 8))) * 3548 > 12*1024:
#         print(ser)
#         break 

# --------------------------------------------------------------------------------------------

# 1. При регистрации в компьютерной системе каждому пользователю выдаётся
# пароль, состоящий из 15 символов и содержащий только символы Е, Г, Э, 2, 0, 1, 3.
# Каждый такой пароль в компьютерной программе записывается минимально
# возможным и одинаковым целым количеством байт (при этом используют
# посимвольное кодирование и все символы кодируются одинаковым и минимально
# возможным количеством бит). Сколько байт памяти требуется для записи 25
# паролей?

# from math import *

# n = 7 # мощность алфавита 
# i = ceil(log2(n)) #бит на 1 символ

# # pas - байт

# pas = ceil(15 * (i / 8)) * 25

# print(pas)


# ----------------------------------------------------------------------------------------

# 2. Для регистрации на сайте некоторой страны пользователю необходимо
# придумать пароль длиной ровно 15 символов. В пароле можно использовать
# десятичные цифры и 11 различных символов местного алфавита, причем все
# буквы используются в двух начертаниях - строчные и прописные. Каждый символ
# кодируется одинаковым и минимально возможным количеством бит, а каждый
# пароль - одинаковым и минимально возможным количеством байт. Сколько байт
# памяти требуется для хранения 30 паролей?

# from math import *
# #pas - байты
# #15 окошек

# n = 21 * 2 

# i = ceil(log2(n)) #бит на 1 символ

# pas = ceil((15 * (i /8 )) *30)
# print(pas)

#-------------------------------

#pas - 15 символов, байт

# n = 22 + 10
# i = ceil(log2(n))

# pas = ceil((15 * i))
# pas = ceil(pas / 8) * 30
# print(pas)


# ------------------------------------------------------------------------------------------

# 3. В некоторой стране автомобильный номер длиной 7 символов составляется из
# заглавных букв (всего используется 22 буквы) и десятичных цифр в любом
# порядке. Каждый символ кодируется одинаковым и минимально возможным
# количеством бит, а каждый номер - одинаковым и минимально возможным целым
# количеством байт. Сколько байт памяти требуется для хранения 50 автомобильных
# номеpOB?

# from math import *


# #num - 7 символов, БАЙТЫ 
# n = 22 + 10

# i = ceil(log2(n)) # бит на 1 символ

# num = ceil((7 * (i / 8))) # 1 номер в байтах 

# ans = (num * 50)

# print(ans)

# --------------------------------------------------------------------------------------

# 4. В некоторой стране автомобильный номер длиной 5 символов составляется из
# заглавных букв (всего используется 26 букв) и десятичных цифр в любом порядке.
# Каждый символ кодируется одинаковым и минимально возможным количеством
# бит, а каждый номер - одинаковым и минимально возможным целым количеством
# байт. Сколько байт памяти требуется для хранения 40 автомобильных номеров?


# from math import *

# # num - 5 символов, БАЙТЫ 

# n = 26 + 10

# i = ceil(log2(n)) #бит на 1 символ

# num = ceil( 5 * (i / 8) )
# ans = num * 40
# print(ans)


# -------------------------------------------------------------------------------------------

# 5. В некоторой стране автомобильный номер длиной 5 символов составляется из
# заглавных букв (всего используется 30 букв) и десятичных цифр в любом порядке.
# Каждый символ кодируется одинаковым и минимально возможным количеством
# бит, а каждый номер - одинаковым и минимально возможным целым количеством
# байт. Сколько байт памяти требуется для хранения 50 автомобильных номеров?

#num - 5 символов, байты
# from math import *
# n = 40

# i = ceil(log2(n)) # бит на 1 символ

# num = ceil((5 * (i / 8))) * 50

# print(num)

# -----------------------------------------------------------------------------------------------

# 6. В некоторой стране автомобильный номер длиной 10 символов составляется из
# заглавных букв (всего используется 21 буква) и десятичных цифр в любом порядке.
# Каждый символ кодируется одинаковым и минимально возможным количеством
# бит, а каждый номер - одинаковым и минимально возможным целым количеством
# байт. Сколько байт памяти требуется для хранения 81 автомобильного номера?

# from math import *
# #num - 10 символов, байт
# n = 21 + 10
# i = ceil(log2(n))

# num = ceil((10 * (i / 8))) * 81

# print(num)
# -------------------------------------------------------------------------------------------------

# 7. При регистрации в компьютерной системе, используемой при проведении
# командной олимпиады, каждому ученику выдается уникальный идентификатор -
# целое число от 1 до 1000. Для хранения каждого идентификатора используется
# одинаковое и минимально возможное количество бит. Идентификатор команды
# состоит из последовательно записанных идентификаторов учеников и 8
# дополнительных бит. Для записи каждого идентификатора команды система
# использует одинаковое и минимально возможное количество байт. Во всех
# командах равное количество участников. Сколько участников в каждой команде,
# если для хранения идентификаторов 20 команд-участниц потребовалось 180 байт?

#id - 1 число 
# from math import *
# n = 999
# i = ceil(log2(n)) # бит на 1 символ 

# for l in range(1, 10000):
#     id = ceil(((l * i) + 8))  
#     id_c = ceil(id / 8)
#     if id_c * 20 == 180:
#         print(l)
#         break

# -----------------------------------------------------------------------------------------

# 8. При регистрации в компьютерной системе каждому пользователю выдаётся
# пароль, состоящий из 15 символов и содержащий только символы А, Б, В, Г, Д, Е.
# Каждый такой пароль в компьютерной программе записывается минимально
# возможным и одинаковым целым количеством байт, при этом используют
# посимвольное кодирование и все символы кодируются одинаковым и минимально
# возможным количеством бит. Определите, сколько байт необходимо для хранения
# 20 паролей.

# pas - 15 символов, байт
# from math import *
# n = 6 
# i = ceil(log(n))

# pas = ceil((15 * i) / 8) * 20
# print(pas)

#--------------------------------

# n = 6
# i = ceil(log2(n))

# pas = ceil((15 * i))
# pas = ceil(pas / 8) * 20
# print(pas)


# ----------------------------------------------------------------------------------------

# 9. При регистрации в компьютерной системе каждому пользователю выдаётся
# пароль, состоящий из 30 символов и содержащий только символы А, Б, В, Г, Д.
# Каждый такой пароль в компьютерной программе записывается минимально
# возможным и одинаковым целым количеством байт, при этом используют
# посимвольное кодирование и все символы кодируются одинаковым и минимально
# возможным количеством бит. Определите, сколько байт необходимо для хранения
# 50 паролей.

# from math import *
# #pas - 30 символов, байт
# n = 5
# i = ceil(log2(n))

# pas = ceil(((30 * i) / 8)) * 50

# print(pas)

# -----------------------------------------------------------------------------------------------

# 10. При регистрации в компьютерной системе каждому пользователю выдаётся
# пароль, состоящий из 7 символов и содержащий только символы из 10-
# символьного набора: A, B, C, D, E, F, G, H, K, L. B базе данных для хранения
# сведений о каждом пользователе отведено одинаковое и минимально возможное
# целое число байт. При этом используют посимвольное кодирование паролей, все
# символы кодируют одинаковым и минимально возможным количеством бит. Кроме
# собственно пароля, для каждого пользователя в системе хранятся дополнительные
# сведения, для чего отведено 16 байт на одного пользователя. Определите объём
# памяти (в байтах), необходимый для хранения сведений о 20 пользователях.

# pas - 7 символов, байт
# from math import *
# n = 10
# i = ceil(log2(n))

# pas = ceil((7 * i) / 8) # пароль для 1 пользователя в байтах 

# ans = (pas + 16) * 20 

# print(ans)


# --------------------------------------------------------------------------------

# При регистрации в компьютерной системе каждому пользователю выдаётся пароль,
# состоящий из 15 символов и содержащий только десятичные цифры и символы из
# 12-символьного набора: А, В, C, D, Е, F, G, H, K, L, M, N. 
# В базе данных для хранения каждого пароля отведено одинаковое и минимально возможное целое число байт.
# При этом используют посимвольное кодирование паролей,
# все символы кодируются одинаковым и минимально возможным количеством бит.
# Кроме собственно пароля, для каждого пользователя в системе хранятся дополнительные сведения,
# для чего отведено 12 байт на одного пользователя.

# Определите объём памяти (в байтах), необходимый для хранения данных о 40 пользователях.
# В ответе запишите только целое число — количество байт.

# from math import *
# k = 15
# n = 10 + 12
# i = ceil(log2(n))
# us = ceil((k * i) / 8) + 12
# ans = us * 40
# print(ans) 

# ------------------------------------------------------------------------------------

# На предприятии каждой изготовленной детали присваивают серийный номер, состоящий из 76 символов.
# В базе данных для хранения каждого серийного номера отведено одинаковое и минимально возможное целое число байт.
# При этом используется посимвольное кодирование серийных номеров, 
# все символы кодируются одинаковым и минимально возможным числом бит. 
# Известно, что для хранения 31 598 серийных номеров отведено не более 1894 Кбайт памяти.

# Определите максимально возможную мощность алфавита, используемого для записи серийных номеров.
# В ответе запишите только целое число.
# from math import *
# k = 76
# nums = []
# for n in range(1,100000):
#     i = ceil(log2(n))
#     num = ceil((k * i))
#     num_bait = ceil((num / 8))
#     num_all = (num_bait * 31598) / 1024
#     if num_all <= 1894:
#         nums.append(n)

# print(nums[-1])

# --------------------------------------------------------------------------------------

# На предприятии каждой изготовленной детали присваивают серийный номер,
# содержащий десятичные цифры, 52 латинские буквы (с учётом регистра) и символы из 500-символьного специального алфавита.
# В базе данных каждый серийный номер занимает одинаковое и минимально возможное число байт.
# При этом используется посимвольное кодирование серийных номеров,
# все символы кодируются одинаковым и минимально возможным числом бит.
# Известно, что для хранения 45 877 серийных номеров требуется более 49 Мбайт памяти.

# Определите минимально допустимую длину серийного номера. В ответе запишите только целое число.
# from math import *
# n = 10 + 52 + 500
# i = ceil(log2(n))
# for k in range(1,10000):
#     num = ceil((k * i))
#     num = ceil(num / 8)
#     num_all = num * 45877
#     num_mb = num_all / 1024 / 1024
#     if num_mb > 49:
#         print(k)
#         break

# ------------------------------------------------------------------------------------------------------

# На предприятии каждой изготовленной детали присваивают серийный номер из 318 символов,
# который содержит только десятичные цифры, 26 латинских букв (без учёта регистра) и символы из 16 350﻿-﻿символьного
# специального алфавита. В базе данных для хранения каждого серийного номера отведено одинаковое и минимально возможное целое
# число байт. При этом используется посимвольное кодирование серийных номеров, все символы кодируются 
# одинаковым и минимально возможным числом бит.
# Кроме собственно серийного номера по каждой детали в системе хранятся дополнительные сведения,
# для чего выделено целое число байт. Известно, что для хранения 510 серийных номеров с дополнительными сведениями
# отведено не более 315 Кбайт памяти.

# Определите максимально возможный объём дополнительных сведений в байтах, который приходится на один серийный номер. 
# В ответе запишите только целое число.
# from math import *
# k = 318
# n = 10 + 26 + 16350
# i = ceil(log2(n))

# num_bait = ceil((i * k) /8) * 510
# need = 322560
# add = need - num_bait
# ans = add / 510
# print(floor(ans))

# ---------------------------------------------------------------------------------------------------------

# При регистрации в компьютерной системе каждому объекту присваивается идентификатор,
# состоящий из 163 символов. В базе данных для хранения каждого идентификатора отведено одинаковое и минимально возможное
# целое число байт. При этом используют посимвольное кодирование идентификаторов, все символы кодируют 
# одинаковым и минимально возможным количеством бит.

# Известно, что для кодирования 32 768 идентификаторов потребовалось 3264 Килобайт. 
# Определите минимальное количество различных символов в алфавите, который использовали для записи идентификаторов.

# В ответе запишите только целое число — количество различных символов.
from math import *
k = 163
for n in range(1,100000):
    i = ceil(log2(n))
    id = ceil((i * k) /8)
    id_kb = id / 1024
    if id_kb * 32768 == 3264:
        print(n)
        break